In [1]:
import pandas as pd
import numpy as np
import re
import Levenshtein

In [2]:
#import mine data
#primary data
mine_full = pd.read_excel("./Data/new coal/Global-Coal-Mine-Tracker-April-2024 (1).xlsx", sheet_name="Global Coal Mine Tracker (Non-C")
#supplement data
mine_sup1_full = pd.read_excel("./Data/new coal/Global-Coal-Mine-Tracker-September-2024-Supplement-v2 (2).xlsx", sheet_name="Historical Production (non-Chin")
mine_sup2_full =pd.read_excel("./Data/new coal/Global-Coal-Mine-Tracker-December-2024-Supplement-Historical-Production-from-2018-to-2023.xlsx", sheet_name="Historical Production(non-China")

In [3]:
#import plant data
plant_full = pd.read_excel("./Data/new coal/Global-Coal-Plant-Tracker-January-2025.xlsx", sheet_name="Units")

#correct the estimated capacity with capacity factor
plant_full['Est_capacity (MW)']=plant_full['Capacity (MW)']*plant_full['Capacity factor']

#import terminal data
#note: the capacity of terminal dataset may be overestimated, because some terminals not only receive 'coal' but 'all cargo'
terminal_full = pd.read_excel("./Data/new coal/Global-Coal-Terminals-Tracker-December-2024.xlsx", sheet_name="Terminals")

Step 2: Select only operating assets

In [4]:
#mine = mine_full[mine_full['Status'] == 'Operating']
plant = plant_full[plant_full['Status'] == 'operating']
terminal = terminal_full[terminal_full['Status'] == 'Operating']

Step 3: Only keep columns that we need

In [5]:
mine = mine_full[['GEM Mine ID', 'Mine Name', 'Latitude', 'Longitude', 'Country', 'Production (Mtpa)', 'Year of Production','Status','Parent Company']]
plant = plant[['GEM location ID', 'Plant name', 'Latitude', 'Longitude','Country/Area', 'Est_capacity (MW)', 'Parent']]
terminal = terminal[['GEM Terminal ID', 'Coal Terminal Name', 'Latitude', 'Longitude','Country/Area', 'Capacity (Mt)','Owner']] #there's only owner data in terminal dataset

In [6]:
# Rename the column names so they are consistent
mine.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production', 'production year','status','firm']
plant.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production', 'firm']
terminal.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production', 'firm']

Step 4: Select Inida data

In [7]:
mine = mine[mine['country'] == 'India']
plant = plant[plant['country'] == 'India']
terminal = terminal[terminal['country'] == 'India']
mine_sup1 = mine_sup1_full[mine_sup1_full['Country'] == 'India']
mine_sup2 = mine_sup2_full[mine_sup2_full['Country'] == 'India']

Step 5: Select most recent production data for coal mine

In [8]:
# Combine 2 supplement dataset
mine_sup = pd.concat([mine_sup1, mine_sup2], ignore_index=True)
mine_sup.columns

Index(['GEM Mine ID', 'MSHA IDs', 'Country', 'Mine Name', 'Mine Name AKAs',
       'Mine Name (Non-ENG)', 'GEM Wiki Page (ENG)', 'Status',
       'Capacity (Mtpa)', 'Opening Year', 'ROM or Saleable',
       'Coal Output (Annual, Mt) 2023', 'Coal Output (Annual, Mst) 2023',
       'Output Accuracy', 'Coal Output (Annual, Mt) 2022',
       'Coal Output (Annual, Mst) 2022', 'Output Accuracy.1',
       'Coal Output (Annual, Mt) 2021', 'Coal Output (Annual, Mst) 2021',
       'Output Accuracy.2', 'Coal Output (Annual, Mt) 2020',
       'Coal Output (Annual, Mst) 2020', 'Output Accuracy.3',
       'Coal Output (Annual, Mt) 2019', 'Coal Output (Annual, Mst) 2019',
       'Output Accuracy.4', 'Coal Output (Annual, Mt) 2018',
       'Coal Output (Annual, Mst) 2018', 'Output Accuracy.5',
       'Coal Output (Annual, Mt) 2017', 'Coal Output (Annual, Mst) 2017',
       'Output Accuracy.6'],
      dtype='object')

In [9]:
# Replace '-' with NaN
mine_sup.replace('-', pd.NA, inplace=True)
# Generate column names dynamically for 'Coal Output (Annual, Mt)' from 2023 to 2017
years = list(range(2023, 2016, -1))  # List of years from 2023 to 2017
cols = [f"Coal Output (Annual, Mt) {year}" for year in years]

# Select the most recent non-null coal output value
mine_sup["Most_Recent_Coal_Output_Mt"] = mine_sup[cols].bfill(axis=1).iloc[:, 0]

# Identify the corresponding year for the selected coal output
mine_sup["Year_Selected"] = mine_sup[cols].notna().idxmax(axis=1).str.extract(r'(\d{4})')

# Convert 'Year_Selected' to integer
mine_sup["Year_Selected"] = mine_sup["Year_Selected"].astype("Int64")

In [10]:
# Keep necessary columns and rename columns
mine_sup = mine_sup[['GEM Mine ID','Most_Recent_Coal_Output_Mt','Year_Selected']]
mine_sup.columns = ['asset_id', 'production', 'production year']
mine_sup

    asset_id production  production year
0      M4434          4             2023
1      M2697       3.91             2023
2      M2513       2.17             2023
3      M1722       1.32             2023
4      M0573      2.531             2022
..       ...        ...              ...
348    M2859       0.32             2023
349    M6680      0.028             2023
350    M2718       0.04             2022
351    M1746       0.36             2023
352    M2883      0.142             2023

[353 rows x 3 columns]

In [11]:
# Merge supplement data with mine data
# Step 1: Merge mine_sup onto mine, allowing multiple production records per mine
merged = pd.concat([mine, mine_sup], ignore_index=True)

# Step 2: Sort by asset_id and production year (descending) to get the most recent data
merged = merged.sort_values(by=['asset_id', 'production year'], ascending=[True, False])

# Step 3: Group by asset_id and take the first occurrence (most recent)
mine_merged = merged.groupby('asset_id', as_index=False).first()

In [12]:
mine_merged

,asset_id,name,latitude,longitude,country,production,production year,status,firm
0,M0464,Adasa Coal Mine,21.347003,78.953545,India,0.715,2023,Operating,Coal India Ltd [100.0%]
1,M0465,Adriyala Coal Mine,18.6648,79.579,India,1.7,2023,Operating,The Singareni Collieries Co Ltd [100%]
2,M0466,AKK Coal Mine,23.7905,85.9198,India,5.35,2023,Operating,Coal India Ltd [100.0%]
3,M0467,Amadand Coal Mine,23.157942,82.061533,India,3.32,2023,Operating,Coal India Ltd [100.0%]
4,M0468,Amalgamated Keshalpur-West Mudidih (AKWMC) Coa...,23.8078,86.3221,India,3.14,2023,Operating,Coal India Ltd [100.0%]
...,...,...,...,...,...,...,...,...,...
510,M4466,Utkal E Coal Mine,21.086237,84.872237,India,2,2023,Operating,National Aluminium Co Ltd [100%]
511,M4467,Venkatesh Khani Coal mine,17.47979,80.663705,India,*,None,Proposed,The Singareni Collieries Co Ltd [100%]
512,M4468,Bicharpur Coal Mine,23.265914,81.343859,India,0.75,2023,Operating,Aditya Birla Group
513,M6680,None,None,None,None,0.028,2023,None,None
514,M6681,None,None,None,None,0.051,2023,None,None

In [47]:
mine_filtered = mine_merged[mine_merged['production'] == '*']
mine_filtered

,asset_id,name,latitude,longitude,country,production,production year,firm
235,M2688,Lakhimata Coal Mine,23.772858,86.731399,India,*,2022,Coal India Ltd [100.0%]
325,M3877,Kerendari Coal Mine,23.9125,85.0875,India,*,2023,NTPC Ltd [100%]

In [13]:
mine_filtered = mine_merged[mine_merged.isna().any(axis=1)]
mine_filtered

,asset_id,name,latitude,longitude,country,production,production year,status,firm
6,M0470,Ambika Coal Mine,22.352778,82.33861,India,*,None,Proposed,Coal India Ltd [100.0%]
16,M0482,Batura Coal Mine,23.209521,81.639831,India,*,None,Proposed,Coal India Ltd [100.0%]
25,M0491,Chakla Coal Mine,23.733245,84.816684,India,*,None,Proposed,Hindalco Industries Ltd [100%]
26,M0492,Chandragupta Coal Mine,23.9,85.03333,India,*,None,Proposed,Coal India Ltd [100.0%]
32,M0511,Dhirauli Coal Mine,23.936115,82.317817,India,*,None,Proposed,Adani Enterprises Ltd [100.0%]
...,...,...,...,...,...,...,...,...,...
508,M4464,Sherband Coal Mine,22.462479,83.204214,India,*,None,Proposed,Nilkanth Coal Mining [100%]
509,M4465,Utkal D Coal Mine,21.011417,84.939414,India,*,None,Proposed,National Aluminium Co Ltd [100%]
511,M4467,Venkatesh Khani Coal mine,17.47979,80.663705,India,*,None,Proposed,The Singareni Collieries Co Ltd [100%]
513,M6680,None,None,None,None,0.028,2023,None,None
514,M6681,None,None,None,None,0.051,2023,None,None

In [42]:
mine

,asset_id,name,latitude,longitude,country,production,production year,firm
482,M0464,Adasa Coal Mine,21.347003,78.953545,India,0.61,2022,Coal India Ltd [100.0%]
483,M0465,Adriyala Coal Mine,18.6648,79.579,India,1.54,2022,The Singareni Collieries Co Ltd [100%]
484,M0466,AKK Coal Mine,23.7905,85.9198,India,4.25,2022,Coal India Ltd [100.0%]
485,M0467,Amadand Coal Mine,23.157942,82.061533,India,0.87,2022,Coal India Ltd [100.0%]
487,M0468,Amalgamated Keshalpur-West Mudidih (AKWMC) Coa...,23.8078,86.3221,India,4.1,2022,Coal India Ltd [100.0%]
...,...,...,...,...,...,...,...,...
4158,M4458,Pandaveswar Dalurband Coal Mine,23.697576,87.253978,India,0.3,2022,Coal India Ltd [100.0%]
4159,M4459,Parasea Belbaid Coal Mine,23.604032,87.114406,India,0.07,2022,Coal India Ltd [100.0%]
4163,M4463,Prakasham Khani OC Coal Mine,17.943213,80.77821,India,5.27,2023,The Singareni Collieries Co Ltd [100%]
4166,M4466,Utkal E Coal Mine,21.086237,84.872237,India,*,NaN,National Aluminium Co Ltd [100%]
4168,M4468,Bicharpur Coal Mine,23.265914,81.343859,India,0.33,2022,Aditya Birla Group

In [19]:

total_data = pd.concat([mine, plant, terminal], ignore_index=True)

## Sheet 1: Assets

In [10]:
mine_assets = mine[['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']]
plant_assets = plant[['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']]
terminal_assets = terminal[['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']]

In [11]:
mine_assets['product'] = 'coal'
plant_assets['product'] = 'power'
terminal_assets['product'] = 'coal'#may be incorrect because some are 'all cargo'

In [12]:
'''
mine_assets = mine_pri[['GEM Mine ID', 'Mine Name', 'Latitude', 'Longitude', 'Country', 'Production (Mtpa)']]
plant_assets = plant[['GEM location ID', 'Plant name', 'Latitude', 'Longitude','Country/Area', 'Est_capacity (MW)' ]]
terminal_assets = terminal[['GEM Terminal ID', 'Coal Terminal Name', 'Latitude', 'Longitude','Country/Area', 'Capacity (Mt)']]

mine_assets.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']
plant_assets.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']
terminal_assets.columns = ['asset_id', 'name', 'latitude', 'longitude', 'country', 'production']
'''

def process_assets(df):
    # Split data: rows where production = '*' and other numeric rows that can be aggregated
    star_rows = df[df["production"] == '*']  # Rows where production value is '*'
    numeric_rows = df[df["production"] != '*'].copy()  # Other rows that can be aggregated

    # Ensure production is a numeric type
    numeric_rows["production"] = pd.to_numeric(numeric_rows["production"], errors="coerce").fillna(0)

    # Perform groupby aggregation only on numeric rows
    grouped_numeric = numeric_rows.groupby("asset_id", as_index=False).agg({
        "name": "first",
        "latitude": "first",
        "longitude": "first",
        "country": "first",
        "production": "sum",
        "product": "first"
    })

    # Merge the aggregated groupby results with the original rows where production = '*'
    return pd.concat([grouped_numeric, star_rows], ignore_index=True)

# Process each dataset
mine_assets = process_assets(mine_assets)
plant_assets = process_assets(plant_assets)
terminal_assets = process_assets(terminal_assets)

# Combine all asset data
total_assets = pd.concat([mine_assets, plant_assets, terminal_assets], ignore_index=True)

# Output final result
total_assets

,asset_id,name,latitude,longitude,country,production,product
0,M0464,Adasa Coal Mine,21.347003,78.953545,India,0.61,coal
1,M0465,Adriyala Coal Mine,18.6648,79.579,India,1.54,coal
2,M0466,AKK Coal Mine,23.7905,85.9198,India,4.25,coal
3,M0467,Amadand Coal Mine,23.157942,82.061533,India,0.87,coal
4,M0468,Amalgamated Keshalpur-West Mudidih (AKWMC) Coa...,23.8078,86.3221,India,4.1,coal
...,...,...,...,...,...,...,...
909,T1413,Port of Chennai Coal Terminal,13.085456,80.296283,India,8.0,coal
910,T1414,Haji Bunder Port Coal Terminal,19.59,73.41,India,1.8,coal
911,T1415,Visakhapatnam Port Adani Terminal,17.68333,83.2833,India,6.4,coal
912,T1432,Rewas Port Coal Terminal,18.79178,72.914995,India,66.0,coal
913,T1383,Adani Hazira Port Coal Terminal,21.08234,72.627231,India,*,coal

In [13]:
prod_index = total_assets.columns.get_loc('production')

total_assets.insert(prod_index, 'replacement_value', '')

In [14]:
total_assets

,asset_id,name,latitude,longitude,country,replacement_value,production,product
0,M0464,Adasa Coal Mine,21.347003,78.953545,India,,0.61,coal
1,M0465,Adriyala Coal Mine,18.6648,79.579,India,,1.54,coal
2,M0466,AKK Coal Mine,23.7905,85.9198,India,,4.25,coal
3,M0467,Amadand Coal Mine,23.157942,82.061533,India,,0.87,coal
4,M0468,Amalgamated Keshalpur-West Mudidih (AKWMC) Coa...,23.8078,86.3221,India,,4.1,coal
...,...,...,...,...,...,...,...,...
909,T1413,Port of Chennai Coal Terminal,13.085456,80.296283,India,,8.0,coal
910,T1414,Haji Bunder Port Coal Terminal,19.59,73.41,India,,1.8,coal
911,T1415,Visakhapatnam Port Adani Terminal,17.68333,83.2833,India,,6.4,coal
912,T1432,Rewas Port Coal Terminal,18.79178,72.914995,India,,66.0,coal
913,T1383,Adani Hazira Port Coal Terminal,21.08234,72.627231,India,,*,coal

## Sheet 2: Firms

In [15]:
# Select necessary columns
mine_firms = mine[['asset_id', 'name', 'firm']]
plant_firms = plant[['asset_id', 'name', 'firm']]
terminal_firms = terminal[['asset_id', 'name', 'firm']]

In [16]:
# Concatenate all the dfs together
all_firms = pd.concat([mine_firms, plant_firms, terminal_firms], ignore_index=True)

In [17]:
all_firms # 1787 rows

,asset_id,name,firm
0,M0464,Adasa Coal Mine,Western Coalfields Ltd
1,M0465,Adriyala Coal Mine,The Singareni Collieries Co Ltd
2,M0466,AKK Coal Mine,Central Coalfields Ltd
3,M0467,Amadand Coal Mine,South Eastern Coalfields Ltd
4,M0467,Amadand Coal Mine,South Eastern Coalfields Ltd
...,...,...,...
1782,T1058,Tuticorin Port Coal Terminal,V.O. Chidambaranar Port Trust
1783,T1058,Tuticorin Port Coal Terminal,V.O. Chidambaranar Port Trust
1784,T1415,Visakhapatnam Port Adani Terminal,Adani Group
1785,T1177,Visakhapatnam Port Coal Terminal,Visakhapatnam Port Trust (VPT)
1786,T1382,Wadhwan Port Coal Terminal,"Jawaharlal Nehru Port Trust, Maharashtra Marit..."

In [18]:
# Add more columns that will be needed
def add_firms_columns(df, owner_column, firm_type):

    firms = df[[owner_column]].rename(columns={owner_column: 'name'})
    
    # Adding columns
    firms['firm_id'] = np.nan
    firms['final_demand'] = np.nan
    firms['discount_rate'] = np.nan
    firms['unit_price'] = np.nan
    firms['margin'] = np.nan
    firms['leverage_ratio'] = np.nan
    firms['type'] = firm_type
    
    # Adjust order of columns
    firms = firms[['firm_id', 'name', 'final_demand', 'discount_rate', 
                   'unit_price', 'margin', 'leverage_ratio', 'type']]
    
    return firms

# Apply functions
total_firms = add_firms_columns(all_firms, 'firm', 'production')

# Remove duplicates
total_firms.drop_duplicates(subset=['name'], keep='first', inplace=True)

In [19]:
total_firms # 324 rows

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
0,NaN,Western Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
1,NaN,The Singareni Collieries Co Ltd,NaN,NaN,NaN,NaN,NaN,production
2,NaN,Central Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
3,NaN,South Eastern Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
5,NaN,Bharat Coking Coal Ltd,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
1778,NaN,Essar Group,NaN,NaN,NaN,NaN,NaN,production
1779,NaN,Shree Cement,NaN,NaN,NaN,NaN,NaN,production
1780,NaN,Tata Group,NaN,NaN,NaN,NaN,NaN,production
1782,NaN,V.O. Chidambaranar Port Trust,NaN,NaN,NaN,NaN,NaN,production
1785,NaN,Visakhapatnam Port Trust (VPT),NaN,NaN,NaN,NaN,NaN,production

For some datasets, the shares of firms are indicated in the owner names, so we need to separate the firm names

In [20]:
# Filter rows where 'name' contains '['
filtered_df = total_firms[total_firms['name'].str.contains(r'\(', regex=True)]

# Display the filtered rows
filtered_df

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
544,NaN,Anuppur Thermal Energy (MP) Pvt Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
601,NaN,MB Power (Madhya Pradesh) Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
733,NaN,ACB (India) Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
957,NaN,Ind-Barath Energy (Utkal) Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
1194,NaN,Mirzapur Thermal Energy (UP) Pvt Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
1196,NaN,Pench Thermal Energy (MP) Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
1313,NaN,Aditya Birla Chemicals (India) Ltd [100%],NaN,NaN,NaN,NaN,NaN,production
1742,NaN,Mumbai Port Trust (MbPT),NaN,NaN,NaN,NaN,NaN,production
1745,NaN,Essar Group (74%); AM/NS (26%),NaN,NaN,NaN,NaN,NaN,production
1765,NaN,Mormugao Port Trust (MPT),NaN,NaN,NaN,NaN,NaN,production
1770,NaN,New Mangalore Port Trust (NMPT); JSW Infrastru...,NaN,NaN,NaN,NaN,NaN,production
1772,NaN,Paradip Port Trust (PPT),NaN,NaN,NaN,NaN,NaN,production
1785,NaN,Visakhapatnam Port Trust (VPT),NaN,NaN,NaN,NaN,NaN,production

## Format firm names

In [21]:
def process_firm_name(df):
    
    # Step 1: Split the 'name' column by ';' into two separate columns
    df[['name1', 'name2','name3']] = df['name'].str.split(r'[;,]', expand=True)

    # Step 2: Duplicate all other columns for each new entry
    df_expanded = df.drop(columns=['name'])  # Drop the original 'name' column

    # Step 3: Melt the 'name1' and 'name2' columns
    df_flat = pd.melt(df_expanded, id_vars=['firm_id', 'final_demand', 'discount_rate', 'unit_price', 'margin', 'leverage_ratio', 'type'], 
                      value_vars=['name1', 'name2','name3'], value_name='name')

    # Step 4: Remove rows with NaN values in 'name'
    df_flat = df_flat.dropna(subset=['name'])

    # Step 5: Move 'name' to the second column position
    df_flat.insert(1, 'name', df_flat.pop('name'))

    # Reset index for clean output
    df_flat.reset_index(drop=True, inplace=True)

    # Drop 'variable' column
    df_flat = df_flat.drop(columns=['variable'])

    return df_flat

# Apply the function
total_firms_flat = process_firm_name(total_firms)

In [22]:
# Display the result
total_firms_flat # 343 rows

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
0,NaN,Western Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
1,NaN,The Singareni Collieries Co Ltd,NaN,NaN,NaN,NaN,NaN,production
2,NaN,Central Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
3,NaN,South Eastern Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
4,NaN,Bharat Coking Coal Ltd,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
338,NaN,AM/NS (26%),NaN,NaN,NaN,NaN,NaN,production
339,NaN,Bothra Group,NaN,NaN,NaN,NaN,NaN,production
340,NaN,JSW Infrastructure Ltd.,NaN,NaN,NaN,NaN,NaN,production
341,NaN,Maharashtra Maritime Board,NaN,NaN,NaN,NaN,NaN,production
342,NaN,Steel Authority of India [SAIL],NaN,NaN,NaN,NaN,NaN,production

In [23]:
# In the 'firms' sheet, we don't need the share data, so remove them here
# Remove percentage patterns inside square brackets or parentheses
total_firms_flat['name'] = total_firms_flat['name'].str.replace(r'\[.*?\]', '', regex=True)  # Remove square brackets content
total_firms_flat['name'] = total_firms_flat['name'].str.replace(r'\(\d+(\.\d+)?%\)', '', regex=True)  # Remove percentage in parentheses
# Remove a dot at the end of the name (if it exists)
total_firms_flat['name'] = total_firms_flat['name'].str.replace(r'\.$', '', regex=True)
total_firms_flat['name'] = total_firms_flat['name'].str.strip()
total_firms_flat

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
0,NaN,Western Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
1,NaN,The Singareni Collieries Co Ltd,NaN,NaN,NaN,NaN,NaN,production
2,NaN,Central Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
3,NaN,South Eastern Coalfields Ltd,NaN,NaN,NaN,NaN,NaN,production
4,NaN,Bharat Coking Coal Ltd,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
338,NaN,AM/NS,NaN,NaN,NaN,NaN,NaN,production
339,NaN,Bothra Group,NaN,NaN,NaN,NaN,NaN,production
340,NaN,JSW Infrastructure Ltd,NaN,NaN,NaN,NaN,NaN,production
341,NaN,Maharashtra Maritime Board,NaN,NaN,NaN,NaN,NaN,production
342,NaN,Steel Authority of India,NaN,NaN,NaN,NaN,NaN,production

In [24]:
# Function to standardize company names
def standardize_company_name(name):
    # Remove "Ltd" and "Limited"
    name = re.sub(r'\bLtd\b', '', name)
    name = re.sub(r'\bLimited\b', '', name)
    
    # Replace "Co" with "Company"
    name = re.sub(r'\bCo\b', 'Company', name)
    
    # Replace "Corp" with "Corporation"
    name = re.sub(r'\bCorp\b', 'Corporation', name)
    
    # Remove duplicate "Company Company"
    name = re.sub(r'\bCompany\b\s*\bCompany\b', 'Company', name)
    
    # Remove any extra spaces
    name = name.strip()
    
    return name

# Apply the function to the 'Company Name' column
total_firms_flat['name'] = total_firms_flat['name'].apply(standardize_company_name)

In [25]:
total_firms_flat

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
0,NaN,Western Coalfields,NaN,NaN,NaN,NaN,NaN,production
1,NaN,The Singareni Collieries Company,NaN,NaN,NaN,NaN,NaN,production
2,NaN,Central Coalfields,NaN,NaN,NaN,NaN,NaN,production
3,NaN,South Eastern Coalfields,NaN,NaN,NaN,NaN,NaN,production
4,NaN,Bharat Coking Coal,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
338,NaN,AM/NS,NaN,NaN,NaN,NaN,NaN,production
339,NaN,Bothra Group,NaN,NaN,NaN,NaN,NaN,production
340,NaN,JSW Infrastructure,NaN,NaN,NaN,NaN,NaN,production
341,NaN,Maharashtra Maritime Board,NaN,NaN,NaN,NaN,NaN,production
342,NaN,Steel Authority of India,NaN,NaN,NaN,NaN,NaN,production

In [26]:
total_firms_flat = total_firms_flat.drop_duplicates(subset=['name'])

In [27]:
# Function to find pairs of names with less than 3 letters difference
def find_similar_names(df):
    names = df['name'].tolist()  # Get list of names
    similar_names = []

    # Compare each pair of names
    for i in range(len(names)):
        for j in range(i + 1, len(names)):
            # Calculate the Levenshtein distance between the two names
            distance = Levenshtein.distance(names[i], names[j])
            # If the distance is less than 3, consider it similar
            if distance < 3 and distance > 0:
                similar_names.append((names[i], names[j], distance))

    return similar_names

# Find similar names with less than 3 letters difference
similar_names = find_similar_names(total_firms_flat)

# Print the results
for name1, name2, dist in similar_names:
    print(f"'{name1}' & '{name2}':  have a Levenshtein distance of {dist}")

'Western Coalfields' & 'Eastern Coalfields':  have a Levenshtein distance of 2
'South Eastern Coalfields' & 'North Eastern Coalfields':  have a Levenshtein distance of 2
'NTPC' & 'NMDC':  have a Levenshtein distance of 2
'Ambujia Cements' & 'Ambuja Cements':  have a Levenshtein distance of 1
'CG Natural Resources Pvt' & 'MH Natural Resources Pvt':  have a Levenshtein distance of 2
'GVK Energy' & 'GMR Energy':  have a Levenshtein distance of 2
'Kakinada Seaport' & 'Kakinada Seaports':  have a Levenshtein distance of 1

By manually inspecting the data, we also found there are `Gujarat Mineral Development Company` and `Gujarat Mineral Development Corporation`, however there is only info about `Gujarat Mineral Development Corporation` online, so we manually change it here. 

Also it's noticeable that `Ambujia Cements` and `Ambuja Cements` are indeed different firms.

In [28]:
# Manually replace company names
# comment out Gujarat Mineral Development because after filter out cancelled projects, it's not in dataset anymore
# total_firms_flat['name'] = total_firms_flat['name'].replace('Gujarat Mineral Development Company', 'Gujarat Mineral Development Corporation')
total_firms_flat['name'] = total_firms_flat['name'].replace('Kakinada Seaport', 'Kakinada Seaports')
total_firms_flat = total_firms_flat[total_firms_flat['name'] != '-']

/var/folders/3h/83jfd71114x78b1sj0_llf1m0000gp/T/ipykernel_4289/3391142284.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  total_firms_flat['name'] = total_firms_flat['name'].replace('Kakinada Seaport', 'Kakinada Seaports')

In [29]:
total_firms_flat = total_firms_flat.sort_values(by='name')
# Display the unique names
total_firms_flat # 280 rows

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
159,NaN,ACB (India),NaN,NaN,NaN,NaN,NaN,production
338,NaN,AM/NS,NaN,NaN,NaN,NaN,NaN,production
218,NaN,AM/NS Khopoli,NaN,NaN,NaN,NaN,NaN,production
96,NaN,AP Mineral Development Corporation,NaN,NaN,NaN,NaN,NaN,production
316,NaN,APM Terminals,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
221,NaN,Welspun Captive Power Generation,NaN,NaN,NaN,NaN,NaN,production
18,NaN,West Bengal Mineral Development and Trading Co...,NaN,NaN,NaN,NaN,NaN,production
24,NaN,West Bengal Power Development Corporation,NaN,NaN,NaN,NaN,NaN,production
0,NaN,Western Coalfields,NaN,NaN,NaN,NaN,NaN,production
66,NaN,Yazdani International,NaN,NaN,NaN,NaN,NaN,production

In [30]:
unique_firms = total_firms_flat.reset_index(drop=True)
unique_firms = unique_firms.drop_duplicates(subset=['name'])
# Generate a list of firm IDs starting from F001 to Fxxx, based on the length of the DataFrame
unique_firms['firm_id'] = ['F' + str(i+1).zfill(3) for i in range(len(unique_firms))]
unique_firms

,firm_id,name,final_demand,discount_rate,unit_price,margin,leverage_ratio,type
0,F001,ACB (India),NaN,NaN,NaN,NaN,NaN,production
1,F002,AM/NS,NaN,NaN,NaN,NaN,NaN,production
2,F003,AM/NS Khopoli,NaN,NaN,NaN,NaN,NaN,production
3,F004,AP Mineral Development Corporation,NaN,NaN,NaN,NaN,NaN,production
4,F005,APM Terminals,NaN,NaN,NaN,NaN,NaN,production
...,...,...,...,...,...,...,...,...
275,F275,Welspun Captive Power Generation,NaN,NaN,NaN,NaN,NaN,production
276,F276,West Bengal Mineral Development and Trading Co...,NaN,NaN,NaN,NaN,NaN,production
277,F277,West Bengal Power Development Corporation,NaN,NaN,NaN,NaN,NaN,production
278,F278,Western Coalfields,NaN,NaN,NaN,NaN,NaN,production
279,F279,Yazdani International,NaN,NaN,NaN,NaN,NaN,production

# Sheet 3: ownership

In [31]:
all_firms

,asset_id,name,firm
0,M0464,Adasa Coal Mine,Western Coalfields Ltd
1,M0465,Adriyala Coal Mine,The Singareni Collieries Co Ltd
2,M0466,AKK Coal Mine,Central Coalfields Ltd
3,M0467,Amadand Coal Mine,South Eastern Coalfields Ltd
4,M0467,Amadand Coal Mine,South Eastern Coalfields Ltd
...,...,...,...
1782,T1058,Tuticorin Port Coal Terminal,V.O. Chidambaranar Port Trust
1783,T1058,Tuticorin Port Coal Terminal,V.O. Chidambaranar Port Trust
1784,T1415,Visakhapatnam Port Adani Terminal,Adani Group
1785,T1177,Visakhapatnam Port Coal Terminal,Visakhapatnam Port Trust (VPT)
1786,T1382,Wadhwan Port Coal Terminal,"Jawaharlal Nehru Port Trust, Maharashtra Marit..."

In [32]:
all_firms = all_firms.drop_duplicates(subset=['asset_id', 'firm'])
all_firms

,asset_id,name,firm
0,M0464,Adasa Coal Mine,Western Coalfields Ltd
1,M0465,Adriyala Coal Mine,The Singareni Collieries Co Ltd
2,M0466,AKK Coal Mine,Central Coalfields Ltd
3,M0467,Amadand Coal Mine,South Eastern Coalfields Ltd
5,M0468,Amalgamated Keshalpur-West Mudidih (AKWMC) Coa...,Bharat Coking Coal Ltd
...,...,...,...
1781,T1165,Tuna Tekra Port Coal Terminal,Adani Group
1782,T1058,Tuticorin Port Coal Terminal,V.O. Chidambaranar Port Trust
1784,T1415,Visakhapatnam Port Adani Terminal,Adani Group
1785,T1177,Visakhapatnam Port Coal Terminal,Visakhapatnam Port Trust (VPT)
1786,T1382,Wadhwan Port Coal Terminal,"Jawaharlal Nehru Port Trust, Maharashtra Marit..."

In [33]:
ownership = all_firms[['asset_id', 'firm']]
ownership

     asset_id                                               firm
0       M0464                             Western Coalfields Ltd
1       M0465                    The Singareni Collieries Co Ltd
2       M0466                             Central Coalfields Ltd
3       M0467                       South Eastern Coalfields Ltd
5       M0468                             Bharat Coking Coal Ltd
...       ...                                                ...
1781    T1165                                        Adani Group
1782    T1058                      V.O. Chidambaranar Port Trust
1784    T1415                                        Adani Group
1785    T1177                     Visakhapatnam Port Trust (VPT)
1786    T1382  Jawaharlal Nehru Port Trust, Maharashtra Marit...

[890 rows x 2 columns]

In [34]:
def assign_share(firm):
    if any(char.isdigit() for char in firm) or ';' in firm or ',' in firm:
        return ''  # Empty if condition is met
    else:
        return 1  # Share = 1 if no digits, ';' or ','

ownership['share1'] = ownership['firm'].apply(assign_share)

In [35]:
ownership

     asset_id                                               firm share1
0       M0464                             Western Coalfields Ltd      1
1       M0465                    The Singareni Collieries Co Ltd      1
2       M0466                             Central Coalfields Ltd      1
3       M0467                       South Eastern Coalfields Ltd      1
5       M0468                             Bharat Coking Coal Ltd      1
...       ...                                                ...    ...
1781    T1165                                        Adani Group      1
1782    T1058                      V.O. Chidambaranar Port Trust      1
1784    T1415                                        Adani Group      1
1785    T1177                     Visakhapatnam Port Trust (VPT)      1
1786    T1382  Jawaharlal Nehru Port Trust, Maharashtra Marit...

[890 rows x 3 columns]

In [36]:
def process_firm_name_ownership(df):
    
    # Step 1: Split the 'name' column by ';' into two separate columns
    df[['name1', 'name2','name3']] = df['firm'].str.split(r'[;,]', expand=True)

    # Step 2: Duplicate all other columns for each new entry
    df_expanded = df.drop(columns=['firm'])  # Drop the original 'name' column

    # Step 3: Melt the 'name1' and 'name2' columns
    df_flat = pd.melt(df_expanded, id_vars=['asset_id', 'share1'], 
                      value_vars=['name1', 'name2','name3'], value_name='firm')

    # Step 4: Remove rows with NaN values in 'name'
    df_flat = df_flat.dropna(subset=['firm'])

    # Step 5: Move 'name' to the second column position
    df_flat.insert(1, 'firm', df_flat.pop('firm'))

    # Reset index for clean output
    df_flat.reset_index(drop=True, inplace=True)

    # Drop 'variable' column
    df_flat = df_flat.drop(columns=['variable'])

    return df_flat

# Apply the function
ownership_flat = process_firm_name_ownership(ownership)

In [37]:
ownership_flat

    asset_id                              firm share1
0      M0464            Western Coalfields Ltd      1
1      M0465   The Singareni Collieries Co Ltd      1
2      M0466            Central Coalfields Ltd      1
3      M0467      South Eastern Coalfields Ltd      1
4      M0468            Bharat Coking Coal Ltd      1
..       ...                               ...    ...
905    T1160                      Bothra Group
906    T1167           JSW Infrastructure Ltd.
907    T1432        Maharashtra Maritime Board
908    T1382        Maharashtra Maritime Board
909    M0603   Steel Authority of India [SAIL]

[910 rows x 3 columns]

In [38]:
def extract_percentage(firm):
    match = re.search(r'[\[\(](\d+(\.\d+)?%)[]\)]', firm)
    return match.group(1) if match else ''

# Apply the function to create the new column
ownership_flat['share2'] = ownership_flat['firm'].apply(extract_percentage)
ownership_flat

    asset_id                              firm share1 share2
0      M0464            Western Coalfields Ltd      1
1      M0465   The Singareni Collieries Co Ltd      1
2      M0466            Central Coalfields Ltd      1
3      M0467      South Eastern Coalfields Ltd      1
4      M0468            Bharat Coking Coal Ltd      1
..       ...                               ...    ...    ...
905    T1160                      Bothra Group
906    T1167           JSW Infrastructure Ltd.
907    T1432        Maharashtra Maritime Board
908    T1382        Maharashtra Maritime Board
909    M0603   Steel Authority of India [SAIL]

[910 rows x 4 columns]

In [39]:
def convert_to_float(value):
    if isinstance(value, str):
        # Convert percentage to float if it exists
        if '%' in value:
            return float(value.replace('%', '')) / 100
        elif value == '':
            return 0.0  # Treat empty strings as 0
    return float(value) if value else 0.0

# Convert 'share1' and 'share2' columns to float
ownership_flat['share1'] = ownership_flat['share1'].apply(convert_to_float)
ownership_flat['share2'] = ownership_flat['share2'].apply(convert_to_float)

# Create a new column 'share' as the sum of 'share1' and 'share2'
ownership_flat['share'] = ownership_flat[['share1', 'share2']].sum(axis=1)
ownership_flat

    asset_id                              firm  share1  share2  share
0      M0464            Western Coalfields Ltd     1.0     0.0    1.0
1      M0465   The Singareni Collieries Co Ltd     1.0     0.0    1.0
2      M0466            Central Coalfields Ltd     1.0     0.0    1.0
3      M0467      South Eastern Coalfields Ltd     1.0     0.0    1.0
4      M0468            Bharat Coking Coal Ltd     1.0     0.0    1.0
..       ...                               ...     ...     ...    ...
905    T1160                      Bothra Group     0.0     0.0    0.0
906    T1167           JSW Infrastructure Ltd.     0.0     0.0    0.0
907    T1432        Maharashtra Maritime Board     0.0     0.0    0.0
908    T1382        Maharashtra Maritime Board     0.0     0.0    0.0
909    M0603   Steel Authority of India [SAIL]     0.0     0.0    0.0

[910 rows x 5 columns]

In [40]:
# In the 'firms' sheet, we don't need the share data, so remove them here
# Remove percentage patterns inside square brackets or parentheses
ownership_flat['firm'] = ownership_flat['firm'].str.replace(r'\[.*?\]', '', regex=True)  # Remove square brackets content
ownership_flat['firm'] = ownership_flat['firm'].str.replace(r'\(\d+(\.\d+)?%\)', '', regex=True)  # Remove percentage in parentheses
# Remove a dot at the end of the name (if it exists)
ownership_flat['firm'] = ownership_flat['firm'].str.replace(r'\.$', '', regex=True)
ownership_flat['firm'] = ownership_flat['firm'].str.strip()
ownership_flat

    asset_id                             firm  share1  share2  share
0      M0464           Western Coalfields Ltd     1.0     0.0    1.0
1      M0465  The Singareni Collieries Co Ltd     1.0     0.0    1.0
2      M0466           Central Coalfields Ltd     1.0     0.0    1.0
3      M0467     South Eastern Coalfields Ltd     1.0     0.0    1.0
4      M0468           Bharat Coking Coal Ltd     1.0     0.0    1.0
..       ...                              ...     ...     ...    ...
905    T1160                     Bothra Group     0.0     0.0    0.0
906    T1167           JSW Infrastructure Ltd     0.0     0.0    0.0
907    T1432       Maharashtra Maritime Board     0.0     0.0    0.0
908    T1382       Maharashtra Maritime Board     0.0     0.0    0.0
909    M0603         Steel Authority of India     0.0     0.0    0.0

[910 rows x 5 columns]

In [41]:
# Standardize firm name
# Function to standardize company names
def standardize_company_name(name):
    # Remove "Ltd" and "Limited"
    name = re.sub(r'\bLtd\b', '', name)
    name = re.sub(r'\bLimited\b', '', name)
    
    # Replace "Co" with "Company"
    name = re.sub(r'\bCo\b', 'Company', name)
    
    # Replace "Corp" with "Corporation"
    name = re.sub(r'\bCorp\b', 'Corporation', name)
    
    # Remove duplicate "Company Company"
    name = re.sub(r'\bCompany\b\s*\bCompany\b', 'Company', name)
    
    # Remove any extra spaces
    name = name.strip()
    
    return name

# Apply the function to the 'Company Name' column
ownership_flat['firm'] = ownership_flat['firm'].apply(standardize_company_name)

In [42]:
# Manually replace company names
#ownership_flat['firm'] = ownership_flat['firm'].replace('Gujarat Mineral Development Company', 'Gujarat Mineral Development Corporation')
ownership_flat['firm'] = ownership_flat['firm'].replace('Kakinada Seaport', 'Kakinada Seaports')

In [43]:
ownership_flat

    asset_id                              firm  share1  share2  share
0      M0464                Western Coalfields     1.0     0.0    1.0
1      M0465  The Singareni Collieries Company     1.0     0.0    1.0
2      M0466                Central Coalfields     1.0     0.0    1.0
3      M0467          South Eastern Coalfields     1.0     0.0    1.0
4      M0468                Bharat Coking Coal     1.0     0.0    1.0
..       ...                               ...     ...     ...    ...
905    T1160                      Bothra Group     0.0     0.0    0.0
906    T1167                JSW Infrastructure     0.0     0.0    0.0
907    T1432        Maharashtra Maritime Board     0.0     0.0    0.0
908    T1382        Maharashtra Maritime Board     0.0     0.0    0.0
909    M0603          Steel Authority of India     0.0     0.0    0.0

[910 rows x 5 columns]

In [44]:
merged = pd.merge(ownership_flat, unique_firms, how='left', left_on='firm', right_on='name')

# Drop unnecessary columns (optional) and select the desired ones
final_ownership = merged[['asset_id', 'firm_id', 'share']]
final_ownership # in the final sheet, 'share' == 0 means there's no share data

    asset_id firm_id  share
0      M0464    F278    1.0
1      M0465    F262    1.0
2      M0466    F056    1.0
3      M0467    F238    1.0
4      M0468    F041    1.0
..       ...     ...    ...
905    T1160    F050    0.0
906    T1167    F119    0.0
907    T1432    F156    0.0
908    T1382    F156    0.0
909    M0603    F240    0.0

[910 rows x 3 columns]

There are some conflicts that the same asset and firm have different share data, we leave it like this for now and will disuss it later

In [45]:
# Check for duplicates based on 'asset_id' and 'firm'
duplicates = ownership_flat.duplicated(subset=['asset_id', 'firm'], keep=False)

# Filter and display duplicate rows
df_duplicates = ownership_flat[duplicates]

# Show results
df_duplicates

,asset_id,firm,share1,share2,share
705,L100000102353,Madhya Pradesh Power Generating Company,0.0,1.00,1.00
706,L100000102353,Madhya Pradesh Power Generating Company,0.0,0.51,0.51
762,L100000102603,Telangana State Power Generation Corporation,0.0,1.00,1.00
763,L100000102603,Telangana State Power Generation Corporation,0.0,0.50,0.50

In [46]:
with pd.ExcelWriter('./Data/coal_supply_chain_india.xlsx') as writer:
    total_assets.to_excel(writer, sheet_name='assets', index=False)
    unique_firms.to_excel(writer, sheet_name='firms', index=False)
    final_ownership.to_excel(writer, sheet_name='ownership', index=False)